# Lock Keeper Interactive Client

The Lock Keeper Client CLI is a basic implementation of the Lock Keeper client that allows for quick testing and troubleshooting.
It provides an interactive terminal with commands for each of the API functions exposed by the `lock_keeper_client::LockKeeperClient` type.
Key information is associated with simple names so that it can be easily referenced in the future.

## Usage

Start the server with `cargo make start`, then run the client with `cargo make cli`.

Note that this tool is built using the current code from the `lock-keeper-client` crate. This makes it useful for testing changes to the client
but it also means that it will break alongside the client crate.


## Commands
Type `help` in the CLI's prompt to see info about all commands.

## Examples

Register a new user:
```
| register testUser GreatPassword1
Logged in to testUser
```

Generate some keys:
```
> generate 
Stored: 1
> generate
Stored: 2
```

Generate a key with a custom name:
```
> generate myFavoriteKey
Stored: myFavoriteKey
```

Print a local key with an autogenerated name:
```
> print 2
name: 2
key_id: 29b47e89b962a703ddf7c9fb57638b72c810ef968296734931d5dcfc913889bd
data: Arbitrary Key - 4a92b4603e556330fb3e9df51cec0fd623336e560af549b7870b20270925f914
```

Print a local key with a custom name:
``` 
> print myFavoriteKey
name: myFavoriteKey
key_id: 916ee9ceb4ef61f59f04e611e26cada3b291f03f700809f810fa7068e06ee165
data: Arbitrary Key - 8fa9f08e7d3d846ce32e33d3081887c368708ff441eb7ee957dca74164a302a1
```

Retrieve a key and update local storage:
```
> retrieve myFavoriteKey
Retrieved: myFavoriteKey
key_id: 916ee9ceb4ef61f59f04e611e26cada3b291f03f700809f810fa7068e06ee165
data: Arbitrary Key - 8fa9f08e7d3d846ce32e33d3081887c368708ff441eb7ee957dca74164a302a1

Updated: myFavoriteKey
```

Print updated key (it's the same):
``` 
> print myFavoriteKey
name: myFavoriteKey
key_id: 916ee9ceb4ef61f59f04e611e26cada3b291f03f700809f810fa7068e06ee165
data: Arbitrary Key - 8fa9f08e7d3d846ce32e33d3081887c368708ff441eb7ee957dca74164a302a1
```

List all keys for the logged in user:
```
> list
name: 1
key_id: 651dac727c25d2b08648b12d9b79f482d090f936e7d76296f90a406a58a8c39f
data: Arbitrary Key - 9c1cf1c5f32f5086e5eb875459196addd76e00c7a3d18ff9df928cb47eefef61


name: myFavoriteKey
key_id: 916ee9ceb4ef61f59f04e611e26cada3b291f03f700809f810fa7068e06ee165
data: Arbitrary Key - 8fa9f08e7d3d846ce32e33d3081887c368708ff441eb7ee957dca74164a302a1


name: 2
key_id: 29b47e89b962a703ddf7c9fb57638b72c810ef968296734931d5dcfc913889bd
data: Arbitrary Key - 4a92b4603e556330fb3e9df51cec0fd623336e560af549b7870b20270925f914
```

Get all audit events for a user:
```
> audit
Audit Events:
----------------------------------
Request ID: 37fd925f-96a6-4f41-add0-7d8aea883ae0
2023-01-05 23:44:53.424 +00:00:00
Register
Started
----------------------------------
```

Get audit events for a key with name `my_favorite_key`:
```
> audit key:my_favorite_key
Audit Events:
----------------------------------
Request ID: edce607b-daa8-42f4-9d1a-acb312ba759a
KeyId("7268ed67a1207c1d4a09b40a5c4f6b5f1848b95451302ae5c1f53044f2f51adf")
2023-01-05 23:46:35.889 +00:00:00
GenerateSecret
Successful
----------------------------------
```

Quit:
```
> exit
```

## Scripting
This CLI runs in interactive mode by default, but it can also run in script mode using the `--script` and `--script-file` args. In script mode, the CLI will run all commands in the script and exit back to the command line once all commands are executed.

Scripts are read as a sequence of normal commands separated by line breaks or semicolons. Anything you'd enter into the interactive terminal, you can also write into a script.

The total execution time of all commands in the script will be printed after completion. This time only includes actual client operations and does not count things like parsing or local state management.  If you're using this time for benchmarks, ensure that you're running the binary in `--release` mode.

```
register
generate
generate
retrieve 2
```

Scripts can also repeat commands using `repeat n` blocks. `n` is the number of times the block will repeat. Use angle brackets to mark the beginning and end of a `repeat` block.

```
register

repeat 5 {
    generate
}

retrieve 3
```

The `--script-file` option allows the user to pass a file path and run the contents as a script. Examples above can all be pasted into script files.

The `---script` option allows a full script to be passed as a string. It can be helpful to use semicolons to separate commands when using this option. When separating commands with semicolons, don't forget to add semicolons to the commands inside of `repeat` blocks.

The following command runs the same script as the `repeat` example above.

```bash
cargo run --bin lock-keeper-client-cli -- --script "register; repeat 5 { generate; } retrieve 3"
```
